const PHOTO_COUNT = { MIN: 1, MAX: 25 };
const LIKE_COUNT = { MIN: 15, MAX: 200 };
const AVATAR_COUNT = { MIN: 1, MAX: 6 };
const COMMENT_COUNT = { MIN: 0, MAX: 30 };

const DESCRIPTIONS = [
  'Солнечная тропинка в лесу',
  'Чашка кофе на деревянном столе',
  'Старые окна с каплями дождя',
  'Закат над спокойным морем',
  'Велосипед у деревянного забора',
  'Уютный плед на кресле',
  'Ночной город с высоты',
  'Руки держат букет цветов',
  'Кот спит на подоконнике',
  'Горные вершины в тумане'
];


const MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const NAMES = [
  'Анна',
  'Мария',
  'Александр',
  'Дмитрий',
  'Екатерина',
  'Михаил',
  'Анастасия',
  'Иван',
  'Елена',
  'Сергей',
];

export {
  PHOTO_COUNT,
  LIKE_COUNT,
  AVATAR_COUNT,
  COMMENT_COUNT,
  DESCRIPTIONS,
  MESSAGES,
  NAMES
};
